print("ยินดีต้องรับเข้าสู่ระบบ")
print("กรูณาป้อนข้อมูลรหัสผู้ใช้งาน")

un = input("Username : ")
pw = input("Password : ")

if un == "admin" and pw == "1234" :
    print("เข้าสู่ระบบเรียบร้อยแล้ว")
    print("ยินดีตอนรับ สวัสดีครับ",un )
    print("กรุณาเลือกระบบงานที่ต้องการทำงาน")
    print("1.โปรแกรมคำนวณเกรด")
    print("2.โปรแกรมคำนวณค่าใช้จ่าย")
    print("3.โปรแกรมคำนวณวิชาฟิสิกส์")
    print("4.โปรแกรมคำนวณวิชาคณิตศาสตรอย่างง่าย")
    print("5.โปรแกรมที่อยากให้พัฒนา")
    job = input("กรุณาเลือกโปแกรมที่ต้องการ  : ")
    if job == "2" :
        print("รายการค่าใช้จ่ายทั้งหมดที่ต้องชำระ")
        price = int(input("ราคาสินค้า : "))
        # vat = int(input("ราคาภาษี : "))
        vat = (7 / 100)
        vat_show = (price * vat)
        result = price + (price * vat)
        float(result)
        print("จำนวนราคาสินค้าทั้งหมด : ", price, "  บาท")
        print("จำนวนภาษีที่ชำระออกไป : ", vat_show, " บาท")
        print("รวมค่าใช้จ่ายทั้งหมดที่ต้องชำระ", result, "บาท")
    elif  job == "1" :
        print("โปกแกรมคำนวณเกรด")
        grade = int(input("กรุณาระบุคะแนนปลายภาคของคุณ :"))
        if grade >= 80:
            print("คุณเกรด A")
        elif grade >= 76 and grade <= 79:
            print("คุณได้เกรด B+")
        elif grade >= 71 and grade <= 75:  # จะทำเงื่่อนไข elif เมื่อเงื่อนไขด้านบนเป็นเท็จ
            print("คุณได้เกรด B")
        elif grade >= 66 and grade <= 70:
            print("คุณได้เกรด C+")
        elif grade >= 61 and grade <= 65:
            print("คุณได้เกรด C")
        elif grade >= 56 and grade <= 60:
            print("คุณได้เกรด D+")
        elif grade >= 50 and grade <= 55:
            print("คุณได้เกรด D")
        else:
            print("คุณสอบไม่ผ่าน")
    elif job == "3" :
        print("โปรแกรมคำนวณหาระยะทางที่เคลื่อนที่ได้ ต่อ 1 หน่วยเวลา")
        s = int(input("ระยะทางที่เคลื่อนที่ได้ (หน่วยเป็น เมตร) : "))
        t = int(input("ระยะเวลาที่ใช้เคลื่อนที่ (หน่วยเป็น วินาที) : "))
        print("ความเร็วปลายที่ใช้  (V): ", (s / t), "m/s")

    elif job == "4" :
        print("โปรแกรมตำนวณเลข")
        num_1 = int(input("จำนวนที่ 1 : "))
        num_2 = int(input("จำนวนที่ 2 : "))

        print("ผลลัพธ์การคำนวณโปรแกรมทั้ง 4 แบบ\n")

        print(num_1, "+", num_2, "=", (num_1 + num_2))
        print(num_1, "-", num_2, "=", (num_1 - num_2))
        print(num_1, "*", num_2, "=", (num_1 * num_2))
        print(num_1, "/", num_2, "=", int((num_1 / num_2)))
    elif job == "5" :
        new_job = input("โปรแกรมที่ต้องการให้เราพัฒนา : " )
        print("ขอบคุณสำหรับข้อเสนอแนะสำหรับโปรแกรมที่ท่าน เสนอมา",new_job)
        print("ทางเราจะขอนำความคคิดเห็นในครั้งนี้ไปพิจารณาอีกครั้งครับ ")
        print("ขอบคุณครับ")

    else :
        print("คุณเลือกระบบงานไม่ถูกต้อง")



else:
    print("ข้อมูลผู้ใช้งานไม่ถูกต้อง")
    print("กรุณากรอกข้อมูลให้อีกครั้ง")
