print("โปรแกรมคำนวณหาระยะทางที่เคลื่อนที่ได้ ต่อ 1 หน่วยเวลา")

s = int(input("ระยะทางที่เคลื่อนที่ได้ (หน่วยเป็น เมตร) : "))
t = int(input("ระยะเวลาที่ใช้เคลื่อนที่ (หน่วยเป็น วินาที) : "))

print("ความเร็วปลายที่ใช้  (V): ",(s/t),"m/s")

"""
#ถ้าต้องการใช้เป็นแบบชั่วโมง
print("โปรแกรมคำนวณหาระยะทางที่เคลื่อนที่ได้ ต่อ 1 หน่วยเวลา")

s = int(input("ระยะทางที่เคลื่อนที่ได้ (หน่วยเป็น กิโลเมตร) : "))
t = int(input("ระยะเวลาที่ใช้เคลื่อนที่ (หน่วยเป็น ชั่วโมง) : "))

print("ความเร็วที่ใช้  (V): ",(s/t),"km/hr")
"""
